In [1]:
import pandas as pd

In [2]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 'Price': [29995, 23600, 61500 , 58900]}

In [3]:
a = pd.DataFrame(GermanCars)
b = pd.DataFrame(japaneseCars)

In [4]:
a

    Company   Price
0      Ford   23845
1  Mercedes  171995
2       BMV  135925
3      Audi   71400

In [5]:
b

       Company  Price
0       Toyota  29995
1        Honda  23600
2       Nissan  61500
3  Mitsubishi   58900

In [6]:
c = pd.concat([a,b],keys=["germany","japan"])

In [7]:
c

               Company   Price
germany 0         Ford   23845
        1     Mercedes  171995
        2          BMV  135925
        3         Audi   71400
japan   0       Toyota   29995
        1        Honda   23600
        2       Nissan   61500
        3  Mitsubishi    58900